# AddHolesForTaps Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationSaveJobOptions..::..AddHolesForTaps Property
FabricationSaveJobOptions Class See Also
---
Set true to have holes for taps on straights added to the created fabrication job.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool AddHolesForTaps { get; set; }
```

Visual Basic
---
```text
Public Property AddHolesForTaps As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool AddHolesForTaps {
	bool get ();
	void set (bool value);
}
```

# See Also
FabricationSaveJobOptions Class
Autodesk.Revit.DB.Fabrication Namespace